Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.3.56/svd/ATSAMDA1J16B.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x42002400</baseAddress>
         <interrupt>
            <name>TCC1</name>
            <value>16</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x42002800</baseAddress>
         <interrupt>
            <name>TCC2</name>
            <value>17</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>USB</name>
         <version>U22221.0.3</version>
         <description>Universal Serial Bus</description>
         <groupName>USB</groupName>
         <prependToName>USB_</prependToName>
         <baseAddress>0x41005000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x200</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>USB</name>
            <value>7</value>
         </interrupt>
         <registers>
            <cluster>
               <name>DEVICE</name>
               <description>USB is Device</description>
               <headerStructName>UsbDevice</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>DEVICE</name>
                              <description>Device Mode</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HOST</name>
                              <description>Host Mode</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>Synchronization Busy</description>
                  <addressOffset>0x2</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>QOSCTRL</name>
                  <description>USB Quality Of Service</description>
                  <addressOffset>0x3</addressOffset>
                  <size>8</size>
                  <resetValue>0x05</resetValue>
                  <fields>
                     <field>
                        <name>CQOS</name>
                        <description>Configuration Quality of Service</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CQOSSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Background (no sensitive operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Sensitive Bandwidth</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUM</name>
                              <description>Sensitive Latency</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Critical Latency</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DQOS</name>
                        <description>Data Quality of Service</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DQOSSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Background (no sensitive operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Sensitive Bandwidth</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEDIUM</name>
                              <description>Sensitive Latency</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Critical Latency</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>DEVICE Control B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <resetValue>0x0001</resetValue>
                  <fields>
                     <field>
                        <name>DETACH</name>
                        <description>Detach</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPDCONF</name>
                        <description>Speed Configuration</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPDCONFSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>FS : Full Speed</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>LS : Low Speed</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>HS : High Speed capable</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HSTM</name>
                              <description>HSTM: High Speed Test Mode (force high-speed mode for test mode)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NREPLY</name>
                        <description>No Reply</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTJ</name>
                        <description>Test mode J</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTK</name>
                        <description>Test mode K</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TSTPCKT</name>
                        <description>Test packet mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OPMODE2</name>
                        <description>Specific Operational Mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GNAK</name>
                        <description>Global NAK</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMHDSK</name>
                        <description>Link Power Management Handshake</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LPMHDSKSelect</name>
                           <enumeratedValue>
                              <name>NO</name>
                              <description>No handshake. LPM is not supported</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ACK</name>
                              <description>ACK</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NYET</name>
                              <description>NYET</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>STALL</name>
                              <description>STALL</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADD</name>
                  <description>DEVICE Device Address</description>
                  <addressOffset>0xA</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DADD</name>
                        <description>Device Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>ADDEN</name>
                        <description>Device Address Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>DEVICE Status</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x40</resetValue>
                  <fields>
                     <field>
                        <name>SPEED</name>
                        <description>Speed Status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>FS</name>
                              <description>Full-speed mode</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-speed mode</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LS</name>
                              <description>Low-speed mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LINESTATE</name>
                        <description>USB Line State Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LINESTATESelect</name>
                           <enumeratedValue>
                              <name>0</name>
                              <description>SE0/RESET</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>FS-J or LS-K State</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2</name>
                              <description>FS-K or LS-J State</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FSMSTATUS</name>
                  <description>Finite State Machine Status</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x01</resetValue>
                  <fields>
                     <field>
                        <name>FSMSTATE</name>
                        <description>Fine State Machine Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>FSMSTATESelect</name>
                           <enumeratedValue>
                              <name>OFF</name>
                              <description>OFF (L3). It corresponds to the powered-off, disconnected, and disabled state</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ON</name>
                              <description>ON (L0). It corresponds to the Idle and Active states</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>SUSPEND (L2)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLEEP</name>
                              <description>SLEEP (L1)</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DNRESUME</name>
                              <description>DNRESUME. Down Stream Resume.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPRESUME</name>
                              <description>UPRESUME. Up Stream Resume.</description>
                              <value>0x20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESET</name>
                              <description>RESET. USB lines Reset.</description>
                              <value>0x40</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FNUM</name>
                  <description>DEVICE Device Frame Number</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>MFNUM</name>
                        <description>Micro Frame Number</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>FNCERR</name>
                        <description>Frame Number CRC Error</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>DEVICE Device Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEND</name>
                        <description>Suspend Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MSOF</name>
                        <description>Micro Start of Frame Interrupt Enable in High Speed Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOF</name>
                        <description>Start Of Frame Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORST</name>
                        <description>End of Reset Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAKEUP</name>
                        <description>Wake Up Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EORSM</name>
                        <description>End Of Resume Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>UPRSM</name>
                        <description>Upstream Resume Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RAMACER</name>
                        <description>Ram Access Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNYET</name>
                        <description>Link Power Management Not Yet Interrupt Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMSUSP</name>
                        <description>Link Power Management Suspend Interrupt Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
